# ExchangeId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ExchangeId Property
ParameterTypeId Class See Also
---
"Exchange ID"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ExchangeId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ExchangeId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ExchangeId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace